CSI API ETABS v1
cAnalysisResults.JointDisplAbs Method
 Reports the absolute joint displacements for the specified point elements. Absolute and relative displacements are the same except when reported for time history load cases subjected to acceleration loading
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int JointDisplAbs(
	string Name,
	eItemTypeElm ItemTypeElm,
	ref int NumberResults,
	ref string[] Obj,
	ref string[] Elm,
	ref string[] LoadCase,
	ref string[] StepType,
	ref double[] StepNum,
	ref double[] U1,
	ref double[] U2,
	ref double[] U3,
	ref double[] R1,
	ref double[] R2,
	ref double[] R3
)
Function JointDisplAbs (
	Name As String,
	ItemTypeElm As eItemTypeElm,
	ByRef NumberResults As Integer,
	ByRef Obj As String(),
	ByRef Elm As String(),
	ByRef LoadCase As String(),
	ByRef StepType As String(),
	ByRef StepNum As Double(),
	ByRef U1 As Double(),
	ByRef U2 As Double(),
	ByRef U3 As Double(),
	ByRef R1 As Double(),
	ByRef R2 As Double(),
	ByRef R3 As Double()
) As Integer
Dim instance As cAnalysisResults
Dim Name As String
Dim ItemTypeElm As eItemTypeElm
Dim NumberResults As Integer
Dim Obj As String()
Dim Elm As String()
Dim LoadCase As String()
Dim StepType As String()
Dim StepNum As Double()
Dim U1 As Double()
Dim U2 As Double()
Dim U3 As Double()
Dim R1 As Double()
Dim R2 As Double()
Dim R3 As Double()
Dim returnValue As Integer
returnValue = instance.JointDisplAbs(Name,
	ItemTypeElm, NumberResults, Obj,
	Elm, LoadCase, StepType, StepNum,
	U1, U2, U3, R1, R2, R3)
int JointDisplAbs(
	String^ Name,
	eItemTypeElm ItemTypeElm,
	int% NumberResults,
	array<String^>^% Obj,
	array<String^>^% Elm,
	array<String^>^% LoadCase,
	array<String^>^% StepType,
	array<double>^% StepNum,
	array<double>^% U1,
	array<double>^% U2,
	array<double>^% U3,
	array<double>^% R1,
	array<double>^% R2,
	array<double>^% R3
)
abstract JointDisplAbs :
        Name : string *
        ItemTypeElm : eItemTypeElm *
        NumberResults : int byref *
        Obj : string[] byref *
        Elm : string[] byref *
        LoadCase : string[] byref *
        StepType : string[] byref *
        StepNum : float[] byref *
        U1 : float[] byref *
        U2 : float[] byref *
        U3 : float[] byref *
        R1 : float[] byref *
        R2 : float[] byref *
        R3 : float[] byref -> int
Parameters
Name
Type: System.String
 The name of an existing point object, point element, or group of objects depending on the value of the ItemTypeElm item.
ItemTypeElm
Type: ETABSv1.eItemTypeElm
 This is one of the following items in the eItemTypeElm enumeration.
 If this item is ObjectElm, the result request is for the point element corresponding to the point object specified by the Name item.
 If this item is Element, the result request is for the point element specified by the Name item.
 If this item is GroupElm, the result request is for all point elements directly or indirectly specified in the group specified by the Name item.
 If this item is SelectionElm, the result request is for all point elements directly or indirectly selected and the Name item is ignored.
NumberResults
Type: System.Int32
 The total number of results returned by the program.
Obj
Type: System.String[]
 This is an array that includes the point object name associated with each result, if any. Some results will have no point object associated with them. For those cases, this item will be blank.
Elm
Type: System.String[]
 This is an array that includes the point element name associated with each result.
LoadCase
Type: System.String[]
 This is an array that includes the name of the analysis case or load combination associated with each result.
StepType
Type: System.String[]
 This is an array that includes the step type, if any, for each result.
StepNum
Type: System.Double[]
 This is an array that includes the step number, if any, for each result.
U1
Type: System.Double[]
 This is a one dimensional array that includes the displacement in the point element local 1 direction for each result. [L]
U2
Type: System.Double[]
 This is a one dimensional array that includes the displacement in the point element local 2 direction for each result. [L]
U3
Type: System.Double[]
 This is a one dimensional array that includes the displacement in the point element local 3 direction for each result. [L]
R1
Type: System.Double[]
 This is a one dimensional array that includes the rotation about the point element local 1 direction for each result. [rad]
R2
Type: System.Double[]
 This is a one dimensional array that includes the rotation about the point element local 2 direction for each result. [rad]
R3
Type: System.Double[]
 This is a one dimensional array that includes the rotation about the point element local 3 direction for each result. [rad]
Return Value
Type: Int32
 Returns zero if the displacements are successfully recovered, otherwise it returns a nonzero value
Remarks
 See Results for more information.
Examples
Public Sub Example()
    Dim ret As Integer = -1
    Dim MyLoadType() As String
    Dim MyLoadName() As String
    Dim MyFunc() As String
    Dim MySF() As Double
    Dim MyTF() As Double
    Dim MyAT() As Double
    Dim MyCSys() As String
    Dim MyAng() As Double
    Dim NumberResults As Integer
    Dim Obj() As String
    Dim Elm() As String
    Dim LoadCase() As String
    Dim StepType() As String
    Dim StepNum() As Double
    Dim U1() As Double
    Dim U2() As Double
    Dim U3() As Double
    Dim R1() As Double
    Dim R2() As Double
    Dim R3() As Double
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
'create steel deck template model
    ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'add linear modal history load case
    ret = SapModel.LoadCases.ModHistLinear.SetCase("MyMHLCASE1")
'set load data
    ReDim MyLoadType(1)
    ReDim MyLoadName(1)
    ReDim MyFunc(1)
    ReDim MySF(1)
    ReDim MyTF(1)
    ReDim MyAT(1)
    ReDim MyCSys(1)
    ReDim MyAng(1)
    MyLoadType(0) = "Load"
    MyLoadName(0) = "DEAD"
    MyFunc(0) = "RAMPTH"
    MySF(0) = 1
    MyTF(0) = 1
    MyAT(0) = 0
    MyCSys(0) = "Global"
    MyAng(0) = 0
    MyLoadType(1) = "Accel"
    MyLoadName(1) = "U2"
    MyFunc(1) = "UnifTH"
    MySF(1) = 2
    MyTF(1) = 1.5
    MyAT(1) = 10
    MyCSys(1) = "Global"
    MyAng(1) = 10
    ret = SapModel.LoadCases.ModHistLinear.SetLoads("MyMHLCASE1", 2, MyLoadType, MyLoadName, MyFunc, MySF, MyTF, MyAT, MyCSys, MyAng)
'run analysis
    System.IO.Directory.CreateDirectory("c:\CSI_API_temp")
    ret = SapModel.File.Save("C:\CSI_API_temp\example.edb")
    ret = SapModel.Analyze.RunAnalysis()
'deselect all cases and combos
    ret = SapModel.Results.Setup.DeselectAllCasesAndCombosForOutput()
'set case selected for output
    ret = SapModel.Results.Setup.SetCaseSelectedForOutput("MyMHLCASE1")
'set modal history output option to step-by-step
    ret = SapModel.Results.Setup.SetOptionModalHist(2)
'get joint absolute displacements
    ret = SapModel.Results.JointDisplAbs("ALL", GroupElm, NumberResults, Obj, Elm, LoadCase, StepType, StepNum, U1, U2, U3, R1, R2, R3)
'check
    If NumberResults > 0 Then ret = 0 Else ret = -1
'close application
    mySapObject.ApplicationExit(False)
'clean up variables
    SapModel = Nothing
    mySapObject = Nothing
   End Sub
See Also
Reference
cAnalysisResults Interface
ETABSv1 Namespace